OpenBeauty/app/controllers/events_controller.rb

  def create
  	@event = Event.new(event_params)
  	@event.creator = current_user
  	if @event.save
---
INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "user_id", "name") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def suscribe
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def adduser
    @user = User.find(params[:id])
    @event = Event.find(params[:test])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]