OpenBeauty/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "name", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$T4jy/WLQTQIxXsqEI3JqDOaskSCpnqnL0K/rGx1X2c4BeSUJkJ61i"], ["updated_at", "2018-05-04 13:39:07.984655"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)